In [2]:
import pandas as pd

In [4]:
df = pd.read_csv("SacramentocrimeJanuary2006.csv")
df.head()

,cdatetime,address,district,beat,grid,crimedescr,ucr_ncic_code,latitude,longitude
0,2001-01-06 0:00,3108 OCCIDENTAL DR,3,3C,1115,10851(A)VC TAKE VEH W/O OWNER,2404,38.550420,-121.391416
1,2001-01-06 0:00,2082 EXPEDITION WAY,5,5A,1512,459 PC BURGLARY RESIDENCE,2204,38.473501,-121.490186
2,2001-01-06 0:00,4 PALEN CT,2,2A,212,10851(A)VC TAKE VEH W/O OWNER,2404,38.657846,-121.462101
3,2001-01-06 0:00,22 BECKFORD CT,6,6C,1443,476 PC PASS FICTICIOUS CHECK,2501,38.506774,-121.426951
4,2001-01-06 0:00,3421 AUBURN BLVD,2,2A,508,459 PC BURGLARY-UNSPECIFIED,2299,38.637448,-121.384613

In [5]:
grid = df['grid']
grid.head()

0    1115
1    1512
2     212
3    1443
4     508
Name: grid, dtype: int64

In [9]:
grid[grid < 1500].shape

(6754,)

In [10]:
grid[grid < 1500].head()

0    1115
2     212
3    1443
4     508
5    1084
Name: grid, dtype: int64

--------------------

In [3]:
import seaborn as sns

In [4]:
titanic_df = sns.load_dataset('titanic')

In [5]:
titanic_df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [6]:
titanic_df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [8]:
titanic_df[['pclass', 'age', 'who']].head(10)

   pclass   age    who
0       3  22.0    man
1       1  38.0  woman
2       3  26.0  woman
3       1  35.0  woman
4       3  35.0    man
5       3   NaN    man
6       1  54.0    man
7       3   2.0  child
8       3  27.0  woman
9       2  14.0  child

In [10]:
titanic_df[['pclass', 'age', 'who']].isnull().head(10)

   pclass    age    who
0   False  False  False
1   False  False  False
2   False  False  False
3   False  False  False
4   False  False  False
5   False   True  False
6   False  False  False
7   False  False  False
8   False  False  False
9   False  False  False

In [11]:
titanic_df[['pclass', 'age', 'who']].isnull().sum()

pclass      0
age       177
who         0
dtype: int64

In [16]:
titanic_df[['age']].head()

    age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0

In [18]:
titanic_df['age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64